<?php

class Holiday {
    public $holiday;
    public $holiday_1;
    public $holiday_2;
    
    function __construct() {
        // 祝日を取得
        $this->holiday_1 = array(
            "2019/1/1" => "元日",
            "2019/1/14" => "成人の日",
            "2019/2/11" => "建国記念の日",
            "2019/3/21" => "春分の日",
            "2019/4/29" => "昭和の日",
            "2019/4/30" => "国民の休日",
            "2019/5/1" => "新天皇即位日",
            "2019/5/2" => "国民の休日",
            "2019/5/3" => "憲法記念日",
            "2019/5/4" => "みどりの日",
            "2019/5/5" => "こどもの日",
            "2019/5/6" => "振替休日",
            "2019/7/15" => "海の日",
            "2019/8/11" => "山の日",
            "2019/8/12" => "振替休日",
            "2019/9/16" => "敬老の日",
            "2019/9/23" => "秋分の日",
            "2019/10/14" => "体育の日",
            "2019/10/22" => "即位礼正殿の儀",
            "2019/11/3" => "文化の日",
            "2019/11/4" => "振替休日",
            "2019/11/23" => "勤労感謝の日",
            
            "2020/1/1" => "元日",
            "2020/1/13" => "成人の日",
            "2020/2/11" => "建国記念の日",
            "2020/2/23" => "天皇誕生日",
            "2020/2/24" => "振替休日",
            "2020/3/20" => "春分の日",
            "2020/4/29" => "昭和の日",
            "2020/5/3" => "憲法記念日",
            "2020/5/4" => "振替休日",
            "2020/5/4" => "みどりの日",
            "2020/5/5" => "こどもの日",
            "2020/7/20" => "海の日",
            "2020/8/11" => "山の日",
            "2020/9/21" => "敬老の日",
            "2020/9/22" => "秋分の日",
            "2020/10/12" => "体育の日",
            "2020/11/3" => "文化の日",
            "2020/11/23" => "勤労感謝の日",
        );
        
         // 会社の休みを追加
        $this->holiday_2 = array(
            "2019/8/9" => "会社休み",
            "2019/8/13" => "会社休み",
            "2019/8/14" => "会社休み",
            "2019/12/30" => "会社休み",
            "2019/12/31" => "会社休み",
            "2020/1/2" => "会社休み",
            "2020/1/3" => "会社休み",
        );
        
        $this->holiday = $this->holiday_1 + $this->holiday_2;
         
        // return $holiday;
    }
    
}